{"pageProps":{"postData":{"id":"mobile-first-design-tips","htmlContent":"<p>Last weekend I released an updated version of my blog and website that share a similar design. I decided to go with a mobile-first approach when it came to the design, which is a tried and tested way to create responsive web applications. Along the way, I tripped up and made a few mistakes that cost me some time and rework, but could have been easily corrected had I had these tips beforehand.</p>\n<h3>Don't Forget the Viewport meta tag</h3>\n<p>More specifically, something like this:</p>\n<pre><code class=\"language-html\">&#x3C;meta name=\"viewport\" content=\"width=device-width, initial-scale=1\" />\n</code></pre>\n<p>I forgot about the first week of implementing my stylesheet. I won't say that all my work was lost after adding it, but it certainly tossed all the detail I had put into the design implementation out the window.</p>\n<p>All modern designs have this header tag. You can <a href=\"https://developer.mozilla.org/en/docs/Mozilla/Mobile/Viewport_meta_tag\">read more about it on the MDN</a> but, to summarize, it defines the width of your application viewport and the scale that it loads up in. Read through the section entitled <a href=\"https://developer.mozilla.org/en/docs/Mozilla/Mobile/Viewport_meta_tag#A_pixel_is_not_a_pixel\">A Pixel is Not a Pixel</a> in the previous MDN article to get a better understand of this.</p>\n<p>The important thing to know is that without this, you will feel pain.</p>\n<h3>Dev Tool Emulators are Your Friends</h3>\n<p>Edge, Chrome, Opera, Firefox, and Safari all have some kind of responsive design emulator tool to help make testing your code easy. Use it from the start, by selecting a pre-set responsive profile for the smallest device you care about for your web application.</p>\n<p>This doesn't replace testing on an real small-screen device, but it definitely gets you moving on the development front.</p>\n<p>Using the built-in emulators from the get-go enforces the mobile-first approach by ensuring that you start with the minimal amount of screen real-estate when building your application. As I learned, it is easy to get caught up in adding extra content because you think you'll have the space, which brings me to the next tip. </p>\n<p><img src=\"http://i.imgur.com/5JsR2Icl.png\" alt=\"Responsive Tools in Internet Explorer\"></p>\n<h3>Start without CSS</h3>\n<p>No really, start without any styling.</p>\n<p>You might wonder why, but it really helps with understanding what \"content\" you're displaying. If you have a large number of elements on the screen that don't actually convey any information, you are probably making your application less accessible. </p>\n<p>For example, if you have a lot of icons that are just there for asthetic purposes, you'll notice them a lot more in the plain HTML version of your site. </p>\n<p>Not using any CSS also helps with the next tip.</p>\n<p><img src=\"http://i.imgur.com/TCDTcPGl.png\" alt=\"My site without CSS\"></p>\n<h3>Show <em>ONLY</em> The Bare Minimum</h3>\n<p>As you work on a page or a view, make sure you know what the bare minimum amount of content can go on the page to make sure it is still usable. Being more of a usability problem, it might be up to your designer or user experience expert to solve this problem, but it'll be up to you to develop and you'll be responsible for \"fixing\" the page when it's too cluttered if you don't have this information up front.</p>\n<p>In my case, I wanted to display a list of blog posts. There is a lot of metadata for each post, but I needed to boil it down the bare minimum. From there, I was able to start placing the elements on screen and start sizing them. As I increased the screen size to test the responsiveness of my design, I added or changed the styling of certain elements to take advantage of the larger screen.</p>\n<blockquote>\n<p>But how do you pick which screen sizes should be considered \"larger\"? There are so many devices with so many different screen sizes! <em>-- You</em></p>\n</blockquote>\n<p>Great question (and segway) into my next tip!</p>\n<h3>Steal Media Query Breakpoints</h3>\n<p>Although every project is a unique flower, at the end of the day the majority of our users are not. At least in the device sense. For this reason, I decided to start with the breakpoints <a href=\"http://getbootstrap.com/css/#responsive-utilities\">defined in Bootstrap 3</a> and ended up using only a few them for what I needed.</p>\n<p>I used a few of the queries defined <a href=\"https://teamtreehouse.com/community/are-there-standard-media-query-break-points\">in this forum post</a> which helped me get my simple, yet responsive, design working on extra small screens and beyond.</p>\n<pre><code class=\"language-css\">>/*==========  Mobile First Method  ==========*/\n\n/* Custom, iPhone Retina */ \n@media only screen and (min-width : 320px) {\n\n}\n\n/* Extra Small Devices, Phones */ \n@media only screen and (min-width : 480px) {\n\n}\n\n/* Small Devices, Tablets */\n@media only screen and (min-width : 768px) {\n\n}\n\n/* Medium Devices, Desktops */\n@media only screen and (min-width : 992px) {\n\n}\n\n/* Large Devices, Wide Screens */\n@media only screen and (min-width : 1200px) {\n\n}\n</code></pre>\n","layout":"post","title":"Mobile First Design Tips","date":"Tue Aug 16 2016 03:55:17 GMT-0500 (Central Daylight Time)","tags":["css","mobile","responsive"],"excerpt":"When redesigning my personal website and blog, I started from scratch and attempted to apply a mobile-first design approach. Here are a few tips that I picked up along the way while creating and implementing my new design that might prevent some mistakes on your own sites.","authorId":"david_wesst","originalurl":"https://blog.davidwesst.com/2016/08/Mobile-First-Design-Tips/"}},"__N_SSG":true}