{"pageProps":{"postData":{"id":"posh-gvm","htmlContent":"<p>Here's another dev thing I use: <a href=\"https://github.com/flofreud/posh-gvm\">Posh-GVM</a>, a Groovy version manager that works for Windows.</p>\n<p>You remember Groovy right? The language that was all the rage at some point with Groovy on Grails?</p>\n<p>All kidding aside, in my adventures as an enterprise JDK developer, I've come across a number of Groovy on Grails applications. These projects tend to span multiple versions of Grails, ranging from 2.3.x which works on older versions of Tomcat, upto 3.2.x for of of our newer solutions. Instead of manually configuring my system for each project, I just use Posh-GVM as recommended by the folks who brought you <a href=\"http://sdkman.io/\">SDKMan for Unix systems</a>.</p>\n<p><img src=\"https://davidwesst.blob.core.windows.net/blog/posh-gvm/poshgvm-example.gif\" alt=\"Posh-GVM in action\" title=\"Posh-GVM in action in a Powershell terminal\"></p>\n<h2>What does it do?</h2>\n<p>It handles switching between versions of Groovy, Grails, and a bunch more technologies without having to fuss with configuring your system. It switch between versions of Grails, Groovy, Gradle, Koitlin, and more with <code>gvm use &#x3C;candidate> &#x3C;version></code> where candidate is the technology and version is...well, the version.</p>\n<h2>Using Posh-GVM</h2>\n<p>Posh-GVM is a Windows port to <a href=\"http://sdkman.io/\">SDKMan</a> formerly known as the GVM, or Groovy eVironment Manager. Instead of requiring a Unix system to run, it requires Powershell.</p>\n<p>To install it, I followed the README instructions to install it via <a href=\"https://github.com/flofreud/posh-gvm#via-short-script\">a short script</a>. I tried using the PsGet method described, but didn't have any luck finding the module. More on that later.</p>\n<p>Once installed (and added to your profile) you can run <code>gvm help</code> in the Powershell terminal and you should see a lovely help menu with all the goodies you can install and switch your fingertips.</p>\n<h3>Won't these conflict with the versions I already have installed?</h3>\n<p>No. It installs the tools in a different directory, so you should be good.</p>\n<p>That being said, you probably don't need to have a local version of Grails or whatever tool installed anymore because Posh-GVM will handle that for you. </p>\n<h2>What makes it cool?</h2>\n<p>It's cool because it works on Windows, without the need for Bash or Cygwin.</p>\n<p>The fact that it covers a number of tools, including Grails, Groovy, and Gradle (and many more) is a pretty nifty too. </p>\n<h2>What are the drawbacks?</h2>\n<p>There are two that stand out to me, but nothing that has made me abandon the tool for something else.</p>\n<h3>Java not included</h3>\n<p>The first being that it doesn't support Java like it's Unix couterpart. My guess is that Java is something special when it comes to Unix VS Windows and was eliminated for that reason. We have <a href=\"http://www.westerndevs.com/java/jabba/\" title=\"My post on Jabba, the Java version manager for everyone\">Jabba</a> for that on Windows, but it would be nice to have all the pieces in to the puzzle in a single tool.</p>\n<h3>Lack of Project Activity</h3>\n<p>The second is the lack of updates.</p>\n<p>As of this writing, it hasn't been updated since <a href=\"https://github.com/flofreud/posh-gvm/commit/2145f8a65c5bf317e96664ebb03bf84c569ba770\">December 2015</a> while SDKMan has continued to be actively developed.</p>\n<p>This isn't necessarily a bad thing, as there haven't been any pull requests in quite some time either. It's just something I note as a risk when I adopt an open source tool.</p>\n<hr>\n<p>Ultimately, I think this tool is a great solution for people that need to use any of these tools, but don't want to couple themselves to Cygwin or Bash for Windows. It has solved my Grails, Groovy, and Gradle versioning issues on Windows, and that is more than enough to make it a win in my books.</p>\n","title":"Posh-GVM, the Groovy Version Manager for Powershell","date":"Thu Aug 17 2017 05:00:00 GMT-0500 (Central Daylight Time)","category":["java"],"tags":["grails","groovy","gradle","powershell","version manager"],"excerpt":"Here's another dev thing I use: Posh-GVM, a Groovy version manager that works for Windows.","layout":"post","authorId":"david_wesst"}},"__N_SSG":true}